In [218]:
import pandas as pd
from pathlib import Path

csv_path = Path('data/titanic.csv')
titanic = pd.read_csv(csv_path)
csv_path = Path('data/summer.csv')
summer = pd.read_csv(csv_path)

# Data Inspection

In [1]:
# always use info() method before, for data inspection, it is must
# use describe() and describe(include = 'O') for object types  try to understand the data

In [27]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [29]:
titanic.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [120]:
# you can set max display row options and min display options for better reading
pd.options.display.max_rows = 100
pd.options.display.min_rows = 30
# by default they are:
pd.options.display.max_rows = 60 # 10
pd.options.display.min_rows = None

In [42]:
titanic.size #number of rows * number of columns

10692

In [44]:
titanic.min(numeric_only=True)

PassengerId    1.00
Survived       0.00
Pclass         1.00
Age            0.42
SibSp          0.00
Parch          0.00
Fare           0.00
dtype: float64

In [46]:
titanic.max(numeric_only=True)

PassengerId    891.0000
Survived         1.0000
Pclass           3.0000
Age             80.0000
SibSp            8.0000
Parch            6.0000
Fare           512.3292
dtype: float64

In [65]:
titanic.mean(numeric_only = True).sort_values()

Parch            0.381594
Survived         0.383838
SibSp            0.523008
Pclass           2.308642
Age             29.699118
Fare            32.204208
PassengerId    446.000000
dtype: float64

In [81]:
# press shift + tab to better look at parameters, autocompletion
titanic.sort_values(by = 'Age', ascending=False)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0000,A23,S
851,852,0,3,"Svensson, Mr. Johan",male,74.0,0,0,347060,7.7750,NaN,S
493,494,0,1,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,NaN,C
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C
116,117,0,3,"Connors, Mr. Patrick",male,70.5,0,0,370369,7.7500,NaN,Q
672,673,0,2,"Mitchell, Mr. Henry Michael",male,70.0,0,0,C.A. 24580,10.5000,NaN,S
745,746,0,1,"Crosby, Capt. Edward Gifford",male,70.0,1,1,WE/P 5735,71.0000,B22,S
33,34,0,2,"Wheadon, Mr. Edward H",male,66.0,0,0,C.A. 24579,10.5000,NaN,S
54,55,0,1,"Ostby, Mr. Engelhart Cornelius",male,65.0,0,1,113509,61.9792,B30,C
280,281,0,3,"Duane, Mr. Frank",male,65.0,0,0,336439,7.7500,NaN,Q
456,457,0,1,"Millet, Mr. Francis Davis",male,65.0,0,0,13509,26.5500,E38,S
438,439,0,1,"Fortune, Mr. Mark",male,64.0,1,4,19950,263.0000,C23 C25 C27,S
545,546,0,1,"Nicholson, Mr. Arthur Ernest",male,64.0,0,0,693,26.0000,NaN,S
275,276,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0,1,0,13502,77.9583,D7,S
483,484,1,3,"Turkula, Mrs. (Hedwig)",female,63.0,0,0,4134,9.5875,NaN,S
570,571,1,2,"Harris, Mr. George",male,62.0,0,0,S.W./PP 752,10.5000,NaN,S
252,253,0,1,"Stead, Mr. William Thomas",male,62.0,0,0,113514,26.5500,C87,S
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0000,B28,NaN
555,556,0,1,"Wright, Mr. George",male,62.0,0,0,113807,26.5500,NaN,S
625,626,0,1,"Sutton, Mr. Frederick",male,61.0,0,0,36963,32.3208,D50,S
326,327,0,3,"Nysveen, Mr. Johan Hansen",male,61.0,0,0,345364,6.2375,NaN,S
170,171,0,1,"Van der hoef, Mr. Wyckoff",male,61.0,0,0,111240,33.5000,B19,S
684,685,0,2,"Brown, Mr. Thomas William Solomon",male,60.0,1,1,29750,39.0000,NaN,S
694,695,0,1,"Weir, Col. John",male,60.0,0,0,113800,26.5500,NaN,S
587,588,1,1,"Frolicher-Stehli, Mr. Maxmillian",male,60.0,1,1,13567,79.2000,B41,C
366,367,1,1,"Warren, Mrs. Frank Manley (Anna Sophia Atkinson)",female,60.0,1,0,110813,75.2500,D37,C
94,95,0,3,"Coxon, Mr. Daniel",male,59.0,0,0,364500,7.2500,NaN,S
232,233,0,2,"Sjostedt, Mr. Ernst Adolf",male,59.0,0,0,237442,13.5000,NaN,S
268,269,1,1,"Graham, Mrs. William Thompson (Edith Junkins)",female,58.0,0,1,PC 17582,153.4625,C125,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
...,...,...,...,...,...,...,...,...,...,...,...,...
718,719,0,3,"McEvoy, Mr. Michael",male,NaN,0,0,36568,15.5000,NaN,Q
727,728,1,3,"Mannion, Miss. Margareth",female,NaN,0,0,36866,7.7375,NaN,Q
732,733,0,2,"Knight, Mr. Robert J",male,NaN,0,0,239855,0.0000,NaN,S
738,739,0,3,"Ivanoff, Mr. Kanio",male,NaN,0,0,349201,7.8958,NaN,S
739,740,0,3,"Nankoff, Mr. Minko",male,NaN,0,0,349218,7.8958,NaN,S
740,741,1,1,"Hawksford, Mr. Walter James",male,NaN,0,0,16988,30.0000,D45,S
760,761,0,3,"Garfirth, Mr. John",male,NaN,0,0,358585,14.5000,NaN,S
766,767,0,1,"Brewe, Dr. Arthur Jackson",male,NaN,0,0,112379,39.6000,NaN,C
768,769,0,3,"Moran, Mr. Daniel J",male,NaN,1,0,371110,24.1500,NaN,Q
773,774,0,3,"Elias, Mr. Dibo",male,NaN,0,0,2674,7.2250,NaN,C
776,777,0,3,"Tobin, Mr. Roger",male,NaN,0,0,383121,7.7500,F38,Q
778,779,0,3,"Kilgannon, Mr. Thomas J",male,NaN,0,0,36865,7.7375,NaN,Q
783,784,0,3,"Johnston, Mr. Andrew G",male,NaN,1,2,W./C. 6607,23.4500,NaN,S
790,791,0,3,"Keane, Mr. Andrew ""Andy""",male,NaN,0,0,12460,7.7500,NaN,Q
792,793,0,3,"Sage, Miss. Stella Anna",female,NaN,8,2,CA. 2343,69.5500,NaN,S
793,794,0,1,"Hoyt, Mr. William Fisher",male,NaN,0,0,PC 17600,30.6958,NaN,C
815,816,0,1,"Fry, Mr. Richard",male,NaN,0,0,112058,0.0000,B102,S
825,826,0,3,"Flynn, Mr. John",male,NaN,0,0,368323,6.9500,NaN,Q
826,827,0,3,"Lam, Mr. Len",male,NaN,0,0,1601,56.4958,NaN,S
828,829,1,3,"McCormack, Mr. Thomas Joseph",male,NaN,0,0,367228,7.7500,NaN,Q
832,833,0,3,"Saad, Mr. Amin",male,NaN,0,0,2671,7.2292,NaN,C
837,838,0,3,"Sirota, Mr. Maurice",male,NaN,0,0,392092,8.0500,NaN,S
839,840,1,1,"Marechal, Mr. Pierre",male,NaN,0,0,11774,29.7000,C47,C
846,847,0,3,"Sage, Mr. Douglas Bullen",male,NaN,8,2,CA. 2343,69.5500,NaN,S
849,850,1,1,"Goldenberg, Mrs. Samuel L (Edwiga Grabowska)",female,NaN,1,0,17453,89.1042,C92,C
859,860,0,3,"Razi, Mr. Raihed",male,NaN,0,0,2629,7.2292,NaN,C
863,864,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.5500,NaN,S
868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,NaN,S
878,879,0,3,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,NaN,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

In [124]:
titanic[['Sex', 'Age', 'PassengerId']]

                                                       Sex   Age  PassengerId
Name
Braund, Mr. Owen Harris                               male  22.0            1
Cumings, Mrs. John Bradley (Florence Briggs Tha...  female  38.0            2
Heikkinen, Miss. Laina                              female  26.0            3
Futrelle, Mrs. Jacques Heath (Lily May Peel)        female  35.0            4
Allen, Mr. William Henry                              male  35.0            5
...                                                    ...   ...          ...
Montvila, Rev. Juozas                                 male  27.0          887
Graham, Miss. Margaret Edith                        female  19.0          888
Johnston, Miss. Catherine Helen "Carrie"            female   NaN          889
Behr, Mr. Karl Howell                                 male  26.0          890
Dooley, Mr. Patrick                                   male  32.0          891

[891 rows x 3 columns]

In [87]:
# you can set index_col to string and use loc['string'] to get that data

In [89]:
titanic = pd.read_csv(csv_path, index_col='Name')

In [95]:
titanic.loc['Barkworth, Mr. Algernon Henry Wilson']
# this works not only for columns titanic.loc[:, 'Names']

PassengerId      631
Survived           1
Pclass             1
Sex             male
Age             80.0
SibSp              0
Parch              0
Ticket         27042
Fare            30.0
Cabin            A23
Embarked           S
Name: Barkworth, Mr. Algernon Henry Wilson, dtype: object

In [ ]:
# reindex() is used with time series

# Pandas Series

In [102]:
age = titanic.Age # created a pandas series from pandas dataframe

In [112]:
age.to_frame().info()

<class 'pandas.core.frame.DataFrame'>
Index: 891 entries, Braund, Mr. Owen Harris to Dooley, Mr. Patrick
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Age     714 non-null    float64
dtypes: float64(1)
memory usage: 46.2+ KB

In [122]:
age.to_frame() # names is index column, so only Age column is counted

                                                     Age
Name
Braund, Mr. Owen Harris                             22.0
Cumings, Mrs. John Bradley (Florence Briggs Tha...  38.0
Heikkinen, Miss. Laina                              26.0
Futrelle, Mrs. Jacques Heath (Lily May Peel)        35.0
Allen, Mr. William Henry                            35.0
...                                                  ...
Montvila, Rev. Juozas                               27.0
Graham, Miss. Margaret Edith                        19.0
Johnston, Miss. Catherine Helen "Carrie"             NaN
Behr, Mr. Karl Howell                               26.0
Dooley, Mr. Patrick                                 32.0

[891 rows x 1 columns]

### unique(), nunique(), value_counts()

In [127]:
age.describe()

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: Age, dtype: float64

In [129]:
age.count()  # skip missing values

714

In [135]:
age.size #len(age)  # include all values inside this series, missing values too

891

In [145]:
age.sum() #by default skipna is enabled
age.sum(skipna = True) # skip missing values

21205.17

In [139]:
sum(age)  # because can't handle missing values

nan

In [149]:
age.median(skipna = True)

28.0

In [151]:
age.min()

0.42

In [153]:
age.max()

80.0

In [170]:
age.unique()

array([22.  , 38.  , 26.  , 35.  ,   nan, 54.  ,  2.  , 27.  , 14.  ,
        4.  , 58.  , 20.  , 39.  , 55.  , 31.  , 34.  , 15.  , 28.  ,
        8.  , 19.  , 40.  , 66.  , 42.  , 21.  , 18.  ,  3.  ,  7.  ,
       49.  , 29.  , 65.  , 28.5 ,  5.  , 11.  , 45.  , 17.  , 32.  ,
       16.  , 25.  ,  0.83, 30.  , 33.  , 23.  , 24.  , 46.  , 59.  ,
       71.  , 37.  , 47.  , 14.5 , 70.5 , 32.5 , 12.  ,  9.  , 36.5 ,
       51.  , 55.5 , 40.5 , 44.  ,  1.  , 61.  , 56.  , 50.  , 36.  ,
       45.5 , 20.5 , 62.  , 41.  , 52.  , 63.  , 23.5 ,  0.92, 43.  ,
       60.  , 10.  , 64.  , 13.  , 48.  ,  0.75, 53.  , 57.  , 80.  ,
       70.  , 24.5 ,  6.  ,  0.67, 30.5 ,  0.42, 34.5 , 74.  ])

In [186]:
len(age.unique())
len(pd.unique(age))  # to get the number of unique values

89

In [190]:
age.nunique()  #built-in to get the number of unique values
# nan is not counted, but in len() it is counted as a value
age.nunique(dropna = True)

88

In [192]:
age.value_counts()

Age
24.00    30
22.00    27
18.00    26
19.00    25
28.00    25
         ..
36.50     1
55.50     1
0.92      1
23.50     1
74.00     1
Name: count, Length: 88, dtype: int64

In [197]:
age.value_counts(dropna = False)

Age
NaN      177
24.00     30
22.00     27
18.00     26
28.00     25
        ...
36.50      1
55.50      1
0.92       1
23.50      1
74.00      1
Name: count, Length: 89, dtype: int64

In [201]:
age.value_counts(sort=True, dropna=True, ascending=False, normalize=True)
# here in percentage results are give, 42% of passangers were aged 24 and so on...

Age
24.00    0.042017
22.00    0.037815
18.00    0.036415
19.00    0.035014
28.00    0.035014
           ...
36.50    0.001401
55.50    0.001401
0.92     0.001401
23.50    0.001401
74.00    0.001401
Name: proportion, Length: 88, dtype: float64

In [205]:
age.value_counts(sort=True, dropna=True, ascending=False, normalize=False, bins=5)
# bins=n

(16.336, 32.252]    346
(32.252, 48.168]    188
(0.339, 16.336]     100
(48.168, 64.084]     69
(64.084, 80.0]       11
Name: count, dtype: int64

## Analyzing non-numerical Series

In [222]:
summer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 31165 entries, 0 to 31164
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Year        31165 non-null  int64
 1   City        31165 non-null  object
 2   Sport       31165 non-null  object
 3   Discipline  31165 non-null  object
 4   Athlete     31165 non-null  object
 5   Country     31161 non-null  object
 6   Gender      31165 non-null  object
 7   Event       31165 non-null  object
 8   Medal       31165 non-null  object
dtypes: int64(1), object(8)
memory usage: 2.1+ MB

In [226]:
athlete = summer.Athlete  # creating a series

In [232]:
athlete.describe()   # type(athletes), dtype(athletes)

count               31165
unique              22762
top       PHELPS, Michael
freq                   22
Name: Athlete, dtype: object

In [234]:
athlete.size

31165

In [240]:
athlete.min()

'AABYE, Edgar'

In [236]:
athlete.count()

31165

In [238]:
athlete.nunique()   # len(athlete.unique)

22762

In [248]:
athlete.unique()

array(['HAJOS, Alfred', 'HERSCHMANN, Otto', 'DRIVAS, Dimitrios', ...,
       'TOTROV, Rustam', 'ALEKSANYAN, Artur', 'LIDBERG, Jimmy'],
      dtype=object)

In [250]:
athlete.value_counts()

Athlete
PHELPS, Michael          22
LATYNINA, Larisa         18
ANDRIANOV, Nikolay       15
ONO, Takashi             13
MANGIAROTTI, Edoardo     13
                         ..
ZAKA, Uddin               1
ZAFAR, Hayat              1
MUHAMMAD, Rashid          1
MANNA, Muhammad Afzal     1
LIDBERG, Jimmy            1
Name: count, Length: 22762, dtype: int64

In [274]:
athlete.value_counts(sort=True, ascending=False, normalize=True)

Athlete
PHELPS, Michael          0.000706
LATYNINA, Larisa         0.000578
ANDRIANOV, Nikolay       0.000481
ONO, Takashi             0.000417
MANGIAROTTI, Edoardo     0.000417
                           ...
ZAKA, Uddin              0.000032
ZAFAR, Hayat             0.000032
MUHAMMAD, Rashid         0.000032
MANNA, Muhammad Afzal    0.000032
LIDBERG, Jimmy           0.000032
Name: proportion, Length: 22762, dtype: float64

In [290]:
# to create a pandas series write:
dic = {1:12, 3:11, 2:45, 5:9, 7:None, 6:0, 4:89}
sales = pd.Series(dic) # by this you can create a pandas series from scratch
sales.sort_index() # this will sort by their index number
sales.sort_values() # this will sort by their values
# sales.sort_index(inplace=True)   # this will do changes to original data not copy
# inplace = True
sales.sort_values(na_position='first', inplace=False)
sales.sort_values(na_position='last')
# when we use inplace=True, we make those changes to original, keep in mind
# we will make changes to original pandas series

6     0.0
5     9.0
3    11.0
1    12.0
2    45.0
4    89.0
7     NaN
dtype: float64

### nlargest(), nsmallest()

In [304]:
age.nlargest(3)  # returns n number of largest values

Name
Barkworth, Mr. Algernon Henry Wilson    80.0
Svensson, Mr. Johan                     74.0
Goldschmidt, Mr. George B               71.0
Name: Age, dtype: float64

In [308]:
age.nsmallest(4)

Name
Thomas, Master. Assad Alexander    0.42
Hamalainen, Master. Viljo          0.67
Baclini, Miss. Helene Barbara      0.75
Baclini, Miss. Eugenie             0.75
Name: Age, dtype: float64

In [314]:
age.sort_values(ascending=True).iloc[:4] #start from beginning till 3 row, it is series
# what i mean, :3, from start till 3, no need for column part as it is 1d array

Name
Thomas, Master. Assad Alexander    0.42
Hamalainen, Master. Viljo          0.67
Baclini, Miss. Eugenie             0.75
Baclini, Miss. Helene Barbara      0.75
Name: Age, dtype: float64

In [362]:
sales.iloc[2] = 20
sales.iloc[0] = 101  # we can assign new values to them by indexing

In [373]:
sales.sort_index().head(3) # as you can see their value changed

1    101.0
2     20.0
3     11.0
dtype: float64

In [377]:
titanic[titanic.Sex=='male'].head(4)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S

In [379]:
only_male = titanic.Sex == 'male'

In [385]:
titanic[only_male].head(4)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S

In [407]:
age = titanic.Age > 25
(only_male & age).head()

0    False
1    False
2    False
3    False
4     True
dtype: bool

In [425]:
# to remove columns use df.drop(columns='columnName')
titanic.drop(columns='PassengerId', inplace=True)
titanic.head(2)  #this inplace=True, removed it from orginal df not the copy

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [469]:
# removing rows
rows = list(range(0, 100))
titanic.drop(index = rows)
titanic.head(3)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [455]:
# summer = summer.loc[summer.Year == 1996]
# summer.head(3)
(summer.Year == 1996).value_counts()
1996 in summer.Year.values

True

In [471]:
# to create a new row:
titanic['New Row'] = 0

In [475]:
relatives = titanic.SibSp + titanic.Parch
titanic.insert(loc=6, column='relatives', value=relatives)

In [490]:
titanic.head(4)

,Survived,Pclass,Name,Sex,Age,SibSp,relatives,Parch,Ticket,Fare,Cabin,Embarked,New Row
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,1,0,A/5 21171,7.2500,NaN,S,0
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,1,0,PC 17599,71.2833,C85,C,0
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,0,STON/O2. 3101282,7.9250,NaN,S,0
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,1,0,113803,53.1000,C123,S,0

## Sorting DataFrames with sort_index() and sort_values()

In [482]:
titanic.Age.sort_values(ascending=False).head()

630    80.0
851    74.0
493    71.0
96     71.0
116    70.5
Name: Age, dtype: float64

In [492]:
titanic.sort_values(by=['Age', 'SibSp', 'Pclass']).head(4)

,Survived,Pclass,Name,Sex,Age,SibSp,relatives,Parch,Ticket,Fare,Cabin,Embarked,New Row
803,1,3,"Thomas, Master. Assad Alexander",male,0.42,0,1,1,2625,8.5167,NaN,C,0
755,1,2,"Hamalainen, Master. Viljo",male,0.67,1,2,1,250649,14.5000,NaN,S,0
469,1,3,"Baclini, Miss. Helene Barbara",female,0.75,2,3,1,2666,19.2583,NaN,C,0
644,1,3,"Baclini, Miss. Eugenie",female,0.75,2,3,1,2666,19.2583,NaN,C,0

### rank()

In [495]:
titanic.Age.rank()

0      218.0
1      532.0
2      310.5
3      488.5
4      488.5
       ...
886    328.5
887    152.0
888      NaN
889    310.5
890    437.5
Name: Age, Length: 891, dtype: float64

In [505]:
titanic.count(axis='index')
titanic.count(axis=0, numeric_only=True) # 0 for rows

Survived     891
Pclass       891
Age          714
SibSp        891
relatives    891
Parch        891
Fare         891
New Row      891
dtype: int64

In [503]:
titanic.count(axis=1, numeric_only=True)

0      8
1      8
2      8
3      8
4      8
      ..
886    8
887    8
888    7
889    8
890    8
Length: 891, dtype: int64

# Histograms